const result = Boolean(0)
console.log(result)

// Логічне та (оператор &&)
// Виводе перше false, якщо буде всі true тоді виводить останнє true

console.log(0 && "" && 5) // вивиде 0
console.log(15 && "hdc" && null) // вивиде null
console.log("false" && false && 1) // вивиде false

// Логічне або (оператор ||)
// Шукає перше true, якщо зустрічає false то пропуская його поки не знайде true, якщо в усіх умовах false то виведе останнє false

console.log(0 || "" || undefined)
console.log(false || 5 || null || 0)
console.log(5 > 3 || 2 < 3 || "test")
console.log(undefined === 0 || 0 === '0' && 5)

//    Напиши скрипт перевірки підписки користувача при доступі до контенту
//  - Є три типи підписки: free, pro та vip.
//  - Отримати доступ можуть лише користувачі pro та vip

// const subscribe = prompt('У вас є підписка: free, pro, vip')
// let hasAccess = subscribe === 'pro' || subscribe === 'vip';
// console.log(hasAccess)

// Напиши скрипт який провіряє можлтвість відкрити чат з користувачем.
//  Для цього користувач має бути:
//  - другом
//  - онлайн

// const isFriend = confirm('Він є вашим другом?')
// const isOnline = confirm('Чи є він в мережі?')
// const chatCheck = isFriend && isOnline;
// console.log(chatCheck)

// Логічний оператор if виконує код якщо умова true

// const userAge = Number(prompt('Скількі вам років?'));
// if (userAge > 18){
//     alert('Ви дорослі')
// }
// else {
//     alert('Ви не дорослий')
// }

// Логічний оператор else if

// if (userAge > 0 && userAge < 18){
//     alert('Ви ще не дорослий')
// }else if (userAge >= 18 && userAge < 60){
//     alert('Ви дорослий')
// }else if (userAge >= 60 && userAge < 100) {
//     alert('Ви пенсіонер')
// } else {
//     alert('Введіть правильній рік')
// }

//   Напиши скрипт обробки покупки в магазині. 
// - Баланс користувача зберігається в змінній balance - отримати з інпуту
// - Сумма покупки зберігається в змінній payment - отримати з інпуту
// - Перед перевіркою вивести повідомлення на екран:
//   «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
//   доступних коштів на рахунку»
// - Якщо сума покупки не перевищує баланс:
// - Відняти з балансу суму покупки
// - Вивести повідомлення «На рахунку залишилося [число] кредитів»
// - Якщо сум
// - Якщо сума покупки перевищує баланс:
// - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
// - В кінці вивести повідомлення «Операція завершена»

// let balance = Number(prompt('Напишіть свій баланс'));
// let payment = Number(prompt('Напишіть сумму покупки'))
// alert(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`)
// if (balance >= payment){
//     balance -= payment;
//     alert(`На рахунку залишилося ${balance} кредитів`)
// } else {
//     alert('На рахунку недостатньо коштів для проведення операції')
// }
// alert('Операція завершена')

// Тернарний оператор
// Умова ? те що буди true : те що буде false
// payment <= balance ? alert(`На рахунку залишилося ${balance} кредитів`) : alert('На рахунку недостатньо коштів для проведення операції')

// Використовуючи конструкцію if..else,
// напишіть код, що запитує: ‘Яка “офіційна” назва 
// JavaScript?’ Якщо відвідувач вводить “ECMAScript”, 
// виведіть “Правильно!”, в іншому випадку — виведіть:
// “Ви не знаєте? ECMAScript!”

// let officialName = prompt('Яка офеційна назва JavaScript')
// if (officialName === 'ECMAScript') {
//     alert('Правильно')
// } else {
//     alert('Ви не знаєте? ECMAScript!')
// }
// officialName === 'ECMAScript' ? alert('Правильно') : alert('Ви не знаєте? ECMAScript!')

// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
// - Загальна сума витрачених коштів зберігається в змінній totalSpent
// - Сума поточного платежа зберігається в змінній payment
// - Знижка зберігається в змінній discount
// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
// - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
// - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
// - Якщо витрачено менше 100) - не партнер, знижка 0%

// - В результаті вивести повідомлення
// «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'

let totalSpent = Number(prompt('Введіть загальну сумму'));
let payment = Number(prompt('Введіть сумму платежа'));
let discount
if (totalSpent > 100 && totalSpent < 1000){
    discount = 2
    payment -= payment *= 0.02
    alert('Ви бронзовий партнер')
} else if (totalSpent > 1000 && totalSpent < 5000){
    discount = 5
    payment -= payment *= 0.05
    alert('Ви срібний партнер')
} else if (totalSpent > 5000) {
    discount = 10
    payment -= payment *= 0.1
    alert('Ви золотий партнер')
} else if (totalSpent < 100){
    discount = 0
    alert('Ви не партнер')
} else {
    alert('Не може бути')
}
alert(`Оформляемо замовлення на суму ${payment} зі знижкою ${discount}%`)