// метод forЕach переберає масив та робить щось з кожним елеменом масиву, нічого не повертає

const friends = ['John', 'Jack', 'Joe'];
friends.forEach((friend, index) => {
    console.log(`Друг ${friend}, має індекс ${index}`)
})

// синтаксис перебераючих методів 
// назвамасива.назваМетоду((елементМасиву, інлексЕлементу) => {тут расписуємо що будемо робити з елементом масиву})

// Метод map переберає масив та з кожним елементом масиву робить те що ми вказали в тілі колбеку, і цей змінений елемент записує у новий масив
const updateFriends = friends.map((friend) => `${friend} is my friend`)
console.log(updateFriends)